БухЭксп/Catalogs/CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПолученияЗначения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МониторинговыйПараметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПараметра</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Объект.Предопределенный;  

	Элементы.Группа4.Видимость	= НЕ Объект.Предопределенный;
	Элементы.Группа5.Видимость 	= НЕ Объект.Предопределенный;
	Элементы.Группа6.Видимость	= НЕ Объект.Предопределенный;	

	Если Параметры.Ключ.Пустая() И Не ПустаяСтрока(Объект.Наименование) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
			Объект.Идентификатор 	= ИдентификаторПоПредставлению();
		КонецЕсли;
	КонецЕсли;  
	
	Если Параметры.Ключ.Пустая() Тогда
		СписокОбъектовПараметра.Добавить("Грузоперевозка",,Истина);
		СписокОбъектовПараметра.Добавить("Заказ");
		СписокОбъектовПараметра.Добавить("Заявка");
	КонецЕсли;
	
	ТекстФормулы.УстановитьТекст(Объект.ТекстФормулы);
	
	СпособПолученияЗначенияПриИзмененииНаСервере();     
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	 СписокОбъектовПараметра = ТекущийОбъект.ОбъектПараметра.Получить();
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	ПроверитьИдентификаторФункции(Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.ТекстФормулы 		= ТекстФормулы.ПолучитьТекст();
	ТекущийОбъект.ОбъектПараметра 	= Новый ХранилищеЗначения(СписокОбъектовПараметра, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПолученияЗначенияПриИзменении(Элемент)
	
	Объект.ИмяРеквизита 	= "";
	Объект.Значение 		= Неопределено;    
	Объект.МониторинговыйПараметр = Неопределено;    
	ТекстФормулы.Очистить();    
	
	СпособПолученияЗначенияПриИзмененииНаСервере();    
	
КонецПроцедуры

&НаСервере
Процедура СпособПолученияЗначенияПриИзмененииНаСервере()
	
	ЭтоСправочникСсылка = Ложь;
	Если Объект.СпособПолученияЗначения = 1 
		И Объект.МониторинговыйПараметр.ТипЗначения <> Неопределено Тогда
			ТипПараметра 		= Объект.МониторинговыйПараметр.ТипЗначения.Типы()[0];
			ЭтоСправочникСсылка = Справочники.ТипВсеСсылки().СодержитТип(ТипПараметра);
	КонецЕсли;
	
	//Реквизит грузоперевозки(0), Мониторинговый параметр(1), Фиксированное значение(2), Формула(3)
	Элементы.ГруппаМониторинговыйПараметр.Видимость = (Объект.СпособПолученияЗначения = 1); 
	Элементы.ИмяРеквизита.Видимость					= (Объект.СпособПолученияЗначения = 0) ИЛИ (Объект.СпособПолученияЗначения = 1 и ЭтоСправочникСсылка); 
	Элементы.ЗначениеПараметра.Видимость 			= (Объект.СпособПолученияЗначения = 1) И Объект.МониторинговыйПараметр.ЭтоКонтрольнаяДата;   
	Элементы.Значение.Видимость 					= (Объект.СпособПолученияЗначения = 2); 
	Элементы.ГруппаФормула.Видимость 				= (Объект.СпособПолученияЗначения = 3) и Не Объект.Предопределенный;   
	
КонецПроцедуры


&НаКлиенте
Процедура МониторинговыйПараметрПриИзменении(Элемент) 
	
	МониторинговыйПараметрПриИзмененииНаСервере(); 
	СпособПолученияЗначенияПриИзмененииНаСервере();     
	
КонецПроцедуры 

 &НаСервере
Процедура МониторинговыйПараметрПриИзмененииНаСервере()
	
	Объект.ЗначениеПараметра = "Значение";
	СпособПолученияЗначенияПриИзмененииНаСервере();     
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаКлиенте();
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьИдентифкатор(Команда)
	
	Объект.Идентификатор = ИдентификаторПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзмененииНаКлиенте()
	
	Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
		Объект.Идентификатор 	= ИдентификаторПоПредставлению();
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ИдентификаторПоПредставлению()
	
	Идентификатор = ПолучитьИдентификаторПоТексту(СокрЛП(Объект.Наименование));
	
	ПолучитьУникальныйИдентификатор(Идентификатор, Идентификатор, Объект.Ссылка);

	Возврат СокрЛП(Идентификатор);
	
КонецФункции   

&НаСервере
Функция ПолучитьИдентификаторПоТексту(Знач Представление) Экспорт
	
	СтрокаЦифр 		= "0123456789";
	Идентификатор 	= "";
	БылРазделитель	 = Ложь; 
	
	Для НомСимвола = 1 По СтрДлина(Представление) Цикл
		Символ = Сред(Представление, НомСимвола, 1);
		Если СтрНайти(СтрокаЦифр,Символ) > 0 
			И ПустаяСтрока(Идентификатор) Тогда
			// цифры в начале пропускаем
			Продолжить;
		КонецЕсли;
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Символ)) Тогда
			БылРазделитель = Истина;
		Иначе
			Если БылРазделитель Тогда
				БылРазделитель = Ложь;
				Символ = ВРег(Символ);
			КонецЕсли;
			Идентификатор = Идентификатор + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(Идентификатор);

КонецФункции 

&НаСервере
Процедура ПроверитьИдентификаторФункции(Отказ) 
	
	СтрокаЦифр		= "0123456789";
	Идентификатор 	= Объект.Идентификатор;
	
	Для НомСимвола = 1 По СтрДлина(Идентификатор) Цикл
		Символ = Сред(Идентификатор, НомСимвола, 1);
		Если НомСимвола = 1 Тогда
			Если СтрНайти(СтрокаЦифр,Символ) > 0 
				ИЛИ Символ = " " Тогда
				// первая цифра
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Идентификатор функции не может начинаться с цифры и пробела!", ,"Идентификатор", "Объект", Отказ);
				Возврат; 
			КонецЕсли;
		КонецЕсли;  
		
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Символ)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Идентификатор функции не может содержать зарезервированные символы ("+Символ+")!", ,"Идентификатор", "Объект", Отказ);
			Возврат; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьУникальныйИдентификатор(Идентификатор, Знач ИсходныйИдентификатор, ТекущаяСсылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета КАК CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета
	               |ГДЕ
	               |	CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.Ссылка <> &Ссылка
	               |	И CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.Идентификатор = &Идентификатор";   
	
	Запрос.УстановитьПараметр("Ссылка", 			ТекущаяСсылка);
	Запрос.УстановитьПараметр("Идентификатор", 		Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	ТекущийКлюч = СтрЗаменить(Идентификатор,ИсходныйИдентификатор,""); 
	ТекущийКлюч = ?(ПустаяСтрока(ТекущийКлюч), 0, Число(ТекущийКлюч));
	ТекущийКлюч = ТекущийКлюч 	+ 1;  
	
	Идентификатор 	= ИсходныйИдентификатор + Формат(ТекущийКлюч, "ЧГ=0");
	
	ПолучитьУникальныйИдентификатор(Идентификатор, ИсходныйИдентификатор, ТекущаяСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь;
	
	АдресСхемы = ПолучитьАдресСхемы();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСхемы", АдресСхемы);   
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборРеквизита", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.Форма.ДоступныеПоля", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьВыборРеквизита(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ИмяРеквизита = РезультатВыбора;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСхемы() 
	
	//Реквизит грузоперевозки(0), Мониторинговый параметр(1), Фиксированное значение(2), Формула(3)
	Если Объект.СпособПолученияЗначения = 0 Тогда
		ИмяТипа = "CW_Грузоперевозки";
	КонецЕсли;
	Если Объект.СпособПолученияЗначения = 1 и Объект.МониторинговыйПараметр.ЭтоСсылочныйТип Тогда
		ТипПараметра = Объект.МониторинговыйПараметр.ТипЗначения.Типы()[0];
		Если Справочники.ТипВсеСсылки().СодержитТип(ТипПараметра) Тогда    
			ТипДанныхXML = XMLТип(ТипПараметра); 
			ИмяТипа	     = СтрЗаменить(ТипДанныхXML.ИмяТипа, "CatalogRef.", "");
		КонецЕсли;
	КонецЕсли;  
	
	Если ИмяТипа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СхемаКомпоновкиДанных 	= Справочники.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.ПолучитьМакет("СхемаРеквизитов"); 
	ТекстЗапроса 			= СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;    
	ТекстЗапроса 			= СтрЗаменить(ТекстЗапроса, "ИмяСправочника", ИмяТипа);
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;	
	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецФункции


&НаКлиенте
Процедура КомандаВедомыйДокумент(Команда)
	ДобавитьПеременную("ВедомыйДокумент");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВсего(Команда)
	ДобавитьПеременную("Всего");
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрузоперевозка(Команда)
	ДобавитьПеременную("Грузоперевозка");
КонецПроцедуры   

&НаКлиенте
Процедура КомандаЗаказ(Команда)
	ДобавитьПеременную("Заказ");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаявка(Команда)
	ДобавитьПеременную("Заявка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументДоходов(Команда)
	ДобавитьПеременную("ДокументДоходов");
КонецПроцедуры   

&НаКлиенте
Процедура КомандаВыбратьФункцию(Команда)   
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборФункции", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.ФормаВыбора", ,ЭтотОбъект,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборФункции(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборФункцииНаСервере(РезультатВыбора);	
	
КонецПроцедуры     

&НаСервере
Процедура ЗавершитьВыборФункцииНаСервере(РезультатВыбора)
	
	ДобавитьПеременную(РезультатВыбора.Идентификатор);
	
КонецПроцедуры     

&НаСервере
Процедура ДобавитьПеременную(ИмяПеременной)
	
	ФормулаТекст = ТекстФормулы.ПолучитьТекст();
	ФормулаТекст = ФормулаТекст + " "+ ИмяПеременной; 
	
	ТекстФормулы.УстановитьТекст(СокрЛП(ФормулаТекст));	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправка(Команда)
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.Форма.ФормаСправкиПоФункции",, ЭтаФорма);
	
КонецПроцедуры
